gakuseiTachi = [
    {"出席番号":"19","学籍番号":"50524","姓":"塚本","名":"博希","姓（カナ）":"ツカモト","名（カナ）":"ヒロキ"},
    {"出席番号":"17","学籍番号":"50259","姓":"田中","名":"大雅","姓（カナ）":"タナカ","名（カナ）":"タイガ"},
    {"出席番号":"18","学籍番号":"50607","姓":"谷分","名":"航晟","姓（カナ）":"タニワケ","名（カナ）":"コウセイ"},
    {"出席番号":"06","学籍番号":"50615","姓":"井上","名":"陽輝","姓（カナ）":"イノウエ","名（カナ）":"ハルキ"},
    {"出席番号":"12","学籍番号":"50128","姓":"須田","名":"陸斗","姓（カナ）":"スダ","名（カナ）":"リクト"},
    {"出席番号":"31","学籍番号":"50100","姓":"三輪","名":"彰","姓（カナ）":"ミワ","名（カナ）":"アキラ"},
    {"出席番号":"32","学籍番号":"50470","姓":"森","名":"将茂","姓（カナ）":"モリ","名（カナ）":"マサシゲ"},
    {"出席番号":"23","学籍番号":"50619","姓":"林","名":"奎汰","姓（カナ）":"ハヤシ","名（カナ）":"ケイタ"},
    {"出席番号":"24","学籍番号":"50505","姓":"日比野","名":"優亜","姓（カナ）":"ヒビノ","名（カナ）":"ユウア"},
    {"出席番号":"01","学籍番号":"50381","姓":"浅井","名":"颯人","姓（カナ）":"アサイ","名（カナ）":"ハヤト"},
    {"出席番号":"16","学籍番号":"50562","姓":"竹内","名":"海翔","姓（カナ）":"タケウチ","名（カナ）":"カイト"},
    {"出席番号":"04","学籍番号":"50108","姓":"池田","名":"峰皐","姓（カナ）":"イケダ","名（カナ）":"ミネタカ"},
    {"出席番号":"02","学籍番号":"50170","姓":"朝倉","名":"柚汰","姓（カナ）":"アサクラ","名（カナ）":"ユウタ"},
    {"出席番号":"26","学籍番号":"50188","姓":"堀","名":"綾花","姓（カナ）":"ホリ","名（カナ）":"アヤカ"},
    {"出席番号":"20","学籍番号":"50379","姓":"仲田","名":"ゆうじ","姓（カナ）":"ナカダ","名（カナ）":"ユウジ"},
    {"出席番号":"13","学籍番号":"50169","姓":"諏訪","名":"百香","姓（カナ）":"スワ","名（カナ）":"モモカ"},
    {"出席番号":"25","学籍番号":"50522","姓":"藤浦","名":"晃士","姓（カナ）":"フジウラ","名（カナ）":"コウシ"},
    {"出席番号":"09","学籍番号":"50340","姓":"カドカ","名":"サガル","姓（カナ）":"カドカ","名（カナ）":"サガル"},
    {"出席番号":"08","学籍番号":"50255","姓":"大洞","名":"和馬","姓（カナ）":"オオボラ","名（カナ）":"カズマ"},
    {"出席番号":"03","学籍番号":"50013","姓":"安藤","名":"優叶","姓（カナ）":"アンドウ","名（カナ）":"ユウト"},
    {"出席番号":"07","学籍番号":"50320","姓":"岩田","名":"綺華","姓（カナ）":"イワタ","名（カナ）":"アヤカ"},
    {"出席番号":"14","学籍番号":"50555","姓":"髙橋","名":"凜乃介","姓（カナ）":"タカハシ","名（カナ）":"リンノスケ"},
    {"出席番号":"21","学籍番号":"50633","姓":"中山","名":"駿","姓（カナ）":"ナカヤマ","名（カナ）":"ハヤト"},
    {"出席番号":"22","学籍番号":"50254","姓":"濵口","名":"千昌","姓（カナ）":"ハマグチ","名（カナ）":"チアキ"},
    {"出席番号":"29","学籍番号":"50197","姓":"溝口","名":"翔斗","姓（カナ）":"ミゾグチ","名（カナ）":"カケト"},
    {"出席番号":"05","学籍番号":"50573","姓":"伊藤","名":"李空","姓（カナ）":"イトウ","名（カナ）":"リクウ"},
    {"出席番号":"27","学籍番号":"50139","姓":"又吉","名":"衛","姓（カナ）":"マタヨシ","名（カナ）":"マモル"},
    {"出席番号":"11","学籍番号":"50412","姓":"菅沼","名":"迦音","姓（カナ）":"スガヌマ","名（カナ）":"カノン"},
    {"出席番号":"33","学籍番号":"50104","姓":"山澤","名":"天人","姓（カナ）":"ヤマサワ","名（カナ）":"アマト"},
    {"出席番号":"10","学籍番号":"50242","姓":"黒田","名":"航太朗","姓（カナ）":"クロダ","名（カナ）":"コウタロウ"},
    {"出席番号":"15","学籍番号":"50743","姓":"髙松","名":"航太","姓（カナ）":"タカマツ","名（カナ）":"コウタ"},
    {"出席番号":"30","学籍番号":"50675","姓":"満","名":"颯太","姓（カナ）":"ミツ","名（カナ）":"ソウタ"},
    {"出席番号":"28","学籍番号":"50140","姓":"松井","名":"優冴","姓（カナ）":"マツイ","名（カナ）":"ユウゴ"},
]


print("改行あり")
print("改行なし",end = "|")
print("続いて表示される")

jyoudan = ""
gedan   = ""
for no in range(len(gakuseiTachi)):
    jyoudan = jyoudan + gakuseiTachi[no]["出席番号"] + " " + (gakuseiTachi[no]["姓"] + "　　")[:3] + "|"
    gedan   = gedan + "   " + (gakuseiTachi[no]["名"] + "　　")[:3] + "|"
    if (no+1)%9 == 0:
        print(jyoudan)
        print(gedan)
        jyoudan = ""
        gedan = ""

