gakuseiTachi = [
    {"出席番号":"01","学籍番号":"50381","姓":"浅井","名":"颯人","姓（カナ）":"アサイ","名（カナ）":"ハヤト"},
    {"出席番号":"02","学籍番号":"50170","姓":"朝倉","名":"柚汰","姓（カナ）":"アサクラ","名（カナ）":"ユウタ"},
    {"出席番号":"03","学籍番号":"50013","姓":"安藤","名":"優叶","姓（カナ）":"アンドウ","名（カナ）":"ユウト"},
    {"出席番号":"04","学籍番号":"50108","姓":"池田","名":"峰皐","姓（カナ）":"イケダ","名（カナ）":"ミネタカ"},
    {"出席番号":"05","学籍番号":"50573","姓":"伊藤","名":"李空","姓（カナ）":"イトウ","名（カナ）":"リクウ"},
    {"出席番号":"06","学籍番号":"50615","姓":"井上","名":"陽輝","姓（カナ）":"イノウエ","名（カナ）":"ハルキ"},
    {"出席番号":"07","学籍番号":"50320","姓":"岩田","名":"綺華","姓（カナ）":"イワタ","名（カナ）":"アヤカ"},
    {"出席番号":"08","学籍番号":"50255","姓":"大洞","名":"和馬","姓（カナ）":"オオボラ","名（カナ）":"カズマ"},
    {"出席番号":"09","学籍番号":"50340","姓":"カドカ","名":"サガル","姓（カナ）":"カドカ","名（カナ）":"サガル"},
    {"出席番号":"10","学籍番号":"50242","姓":"黒田","名":"航太朗","姓（カナ）":"クロダ","名（カナ）":"コウタロウ"},
    {"出席番号":"11","学籍番号":"50412","姓":"菅沼","名":"迦音","姓（カナ）":"スガヌマ","名（カナ）":"カノン"},
    {"出席番号":"12","学籍番号":"50128","姓":"須田","名":"陸斗","姓（カナ）":"スダ","名（カナ）":"リクト"},
    {"出席番号":"13","学籍番号":"50169","姓":"諏訪","名":"百香","姓（カナ）":"スワ","名（カナ）":"モモカ"},
    {"出席番号":"14","学籍番号":"50555","姓":"髙橋","名":"凜乃介","姓（カナ）":"タカハシ","名（カナ）":"リンノスケ"},
    {"出席番号":"15","学籍番号":"50743","姓":"髙松","名":"航太","姓（カナ）":"タカマツ","名（カナ）":"コウタ"},
    {"出席番号":"16","学籍番号":"50562","姓":"竹内","名":"海翔","姓（カナ）":"タケウチ","名（カナ）":"カイト"},
    {"出席番号":"17","学籍番号":"50259","姓":"田中","名":"大雅","姓（カナ）":"タナカ","名（カナ）":"タイガ"},
    {"出席番号":"18","学籍番号":"50607","姓":"谷分","名":"航晟","姓（カナ）":"タニワケ","名（カナ）":"コウセイ"},
    {"出席番号":"19","学籍番号":"50524","姓":"塚本","名":"博希","姓（カナ）":"ツカモト","名（カナ）":"ヒロキ"},
    {"出席番号":"20","学籍番号":"50379","姓":"仲田","名":"ゆうじ","姓（カナ）":"ナカダ","名（カナ）":"ユウジ"},
    {"出席番号":"21","学籍番号":"50633","姓":"中山","名":"駿","姓（カナ）":"ナカヤマ","名（カナ）":"ハヤト"},
    {"出席番号":"22","学籍番号":"50254","姓":"濵口","名":"千昌","姓（カナ）":"ハマグチ","名（カナ）":"チアキ"},
    {"出席番号":"23","学籍番号":"50619","姓":"林","名":"奎汰","姓（カナ）":"ハヤシ","名（カナ）":"ケイタ"},
    {"出席番号":"24","学籍番号":"50505","姓":"日比野","名":"優亜","姓（カナ）":"ヒビノ","名（カナ）":"ユウア"},
    {"出席番号":"25","学籍番号":"50522","姓":"藤浦","名":"晃士","姓（カナ）":"フジウラ","名（カナ）":"コウシ"},
    {"出席番号":"26","学籍番号":"50188","姓":"堀","名":"綾花","姓（カナ）":"ホリ","名（カナ）":"アヤカ"},
    {"出席番号":"27","学籍番号":"50139","姓":"又吉","名":"衛","姓（カナ）":"マタヨシ","名（カナ）":"マモル"},
    {"出席番号":"28","学籍番号":"50140","姓":"松井","名":"優冴","姓（カナ）":"マツイ","名（カナ）":"ユウゴ"},
    {"出席番号":"29","学籍番号":"50197","姓":"溝口","名":"翔斗","姓（カナ）":"ミゾグチ","名（カナ）":"カケト"},
    {"出席番号":"30","学籍番号":"50675","姓":"満","名":"颯太","姓（カナ）":"ミツ","名（カナ）":"ソウタ"},
    {"出席番号":"31","学籍番号":"50100","姓":"三輪","名":"彰","姓（カナ）":"ミワ","名（カナ）":"アキラ"},
    {"出席番号":"32","学籍番号":"50470","姓":"森","名":"将茂","姓（カナ）":"モリ","名（カナ）":"マサシゲ"},
    {"出席番号":"33","学籍番号":"50104","姓":"山澤","名":"天人","姓（カナ）":"ヤマサワ","名（カナ）":"アマト"},
]

bangou =[18,16,17,5,11,30,31,22,23]
for i in bangou:
    
    if len(gakuseiTachi[i]["姓"]) == 1:
        print(gakuseiTachi[i]["出席番号"],gakuseiTachi[i]["姓"],end = "    |")
    elif len(gakuseiTachi[i]["姓"]) == 3:
        print(gakuseiTachi[i]["出席番号"],gakuseiTachi[i]["姓"],end = "|")
    else:
        print(gakuseiTachi[i]["出席番号"],gakuseiTachi[i]["姓"],end="  |")
print()
for i in bangou:
    if len(gakuseiTachi[i]["名"]) == 1:
        print("  ",gakuseiTachi[i]["名"],end="    |")
    else:
        print("  ",gakuseiTachi[i]["名"],end="  |")
print()

bangou2 =[0,15,13,1,25,19,12,24,8]
for q in bangou2:
    
    if len(gakuseiTachi[q]["姓"]) == 1:
        print(gakuseiTachi[q]["出席番号"],gakuseiTachi[q]["姓"],end = "    |")
    elif len(gakuseiTachi[q]["姓"]) == 3:
        print(gakuseiTachi[q]["出席番号"],gakuseiTachi[q]["姓"],end = "|")
    else:
        print(gakuseiTachi[q]["出席番号"],gakuseiTachi[q]["姓"],end="  |")
print()

for q in bangou2:
    if len(gakuseiTachi[q]["名"]) == 1:
        print("  ",gakuseiTachi[q]["名"],end="    |")
    elif len(gakuseiTachi[q]["名"]) == 3:
        print("  ",gakuseiTachi[q]["名"],end="|")
    else:
        print("  ",gakuseiTachi[q]["名"],end="  |")
print()

bangou3 =[7,2,6,13,20,21,28,4,26]
for w in bangou3:
    
    if len(gakuseiTachi[w]["姓"]) == 1:
        print(gakuseiTachi[w]["出席番号"],gakuseiTachi[w]["姓"],end = "    |")
    elif len(gakuseiTachi[w]["姓"]) == 3:
        print(gakuseiTachi[w]["出席番号"],gakuseiTachi[w]["姓"],end = "|")
    else:
        print(gakuseiTachi[w]["出席番号"],gakuseiTachi[w]["姓"],end="  |")
print()
for w in bangou3:
    if len(gakuseiTachi[w]["名"]) == 1:
        print("  ",gakuseiTachi[w]["名"],end="    |")
    elif len(gakuseiTachi[w]["名"]) == 3:
        print("  ",gakuseiTachi[w]["名"],end="|")
    else:
        print("  ",gakuseiTachi[w]["名"],end="  |")
print()

bangou4 =[10,32,9,14,29,27]
for r in range(1,3):
    print("   　  　 　   ",end="")
for e in bangou4:
    
    if len(gakuseiTachi[e]["姓"]) == 1:
        print(gakuseiTachi[e]["出席番号"],gakuseiTachi[e]["姓"],end = "    |")
    elif len(gakuseiTachi[e]["姓"]) == 3:
        print(gakuseiTachi[e]["出席番号"],gakuseiTachi[e]["姓"],end = "|")
    else:
        print(gakuseiTachi[e]["出席番号"],gakuseiTachi[e]["姓"],end="  |")
print()
for t in range(1,3):
    print("    　  　  　 ",end="")
for e in bangou4:
    if len(gakuseiTachi[e]["名"]) == 1:
        print("  ",gakuseiTachi[e]["名"],end="    |")
    elif len(gakuseiTachi[e]["名"]) == 3:
        print("  ",gakuseiTachi[e]["名"],end="|")
    else:
        print("  ",gakuseiTachi[e]["名"],end="  |")
print()



# bangou =[19,17,18,6,12,31,32,23,24]
# bangou2=[1,16,4,2,26,20,13,25,9]
# bangou3=[8,3,7,14,21,22,29,5,27]
# bangou4=[11,33,10,15,30,28]

# for i in bangou:
#     print(gakuseiTachi[bangou]["出席番号"],gakuseiTachi[bangou]["姓"],"|")
#     print("   ",end="")
#     print(gakuseiTachi[bangou]["名"],"|")