group = {
  "グループA":[]
, "グループB":[]
, "グループC":[]
, "グループD":[]
, "グループE":[]
, "グループF":[]
, "グループG":[]
, "グループH":[]
, "グループI":[]
, "グループJ":[]
, "グループK":[]
, "グループL":[]
, "グループM":[]
}

group["グループA"].append({"クラス":"NHIT11A203","出席番号":"19","氏名":"千葉桃香"})
group["グループA"].append({"クラス":"NHIT11A203","出席番号":"28","氏名":"福山理子"})
group["グループA"].append({"クラス":"NHIT11A203","出席番号":"29","氏名":"舟木花帆"})
group["グループA"].append({"クラス":"NHIT11A203","出席番号":"30","氏名":"又吉奏帆"})
group["グループA"].append({"クラス":"NHIT11A203","出席番号":"31","氏名":"水谷倫子"})
group["グループA"].append({"クラス":"NHIT11B203","出席番号":"13","氏名":"諏訪百香"})
group["グループA"].append({"クラス":"NHIT11B203","出席番号":"22","氏名":"濵口千昌"})
group["グループA"].append({"クラス":"NHIT11B203","出席番号":"26","氏名":"堀綾花"})
group["グループB"].append({"クラス":"NHIT11B203","出席番号":"23","氏名":"林奎汰"})
group["グループB"].append({"クラス":"NHIT11B203","出席番号":"24","氏名":"日比野優亜"})
group["グループB"].append({"クラス":"NHIT11B203","出席番号":"25","氏名":"藤浦晃士"})
group["グループB"].append({"クラス":"NHIT11A203","出席番号":"20","氏名":"辻拓実"})
group["グループB"].append({"クラス":"NHIT41A203","出席番号":"07","氏名":"長橋昊紀"})
group["グループB"].append({"クラス":"NHIT11A203","出席番号":"33","氏名":"山口暉仁"})
group["グループB"].append({"クラス":"NHIT11A203","出席番号":"18","氏名":"田中皓晴"})
group["グループC"].append({"クラス":"NHIT11A203","出席番号":"21","氏名":"津田俊介"})
group["グループC"].append({"クラス":"NHIT11A203","出席番号":"27","氏名":"ファールルイマン"})
group["グループC"].append({"クラス":"NHIT11A203","出席番号":"34","氏名":"渡邊悠太"})
group["グループC"].append({"クラス":"NHIT11B203","出席番号":"27","氏名":"又吉衛"})
group["グループC"].append({"クラス":"NHIT11B203","出席番号":"28","氏名":"松井優冴"})
group["グループD"].append({"クラス":"NHIT11B203","出席番号":"01","氏名":"浅井颯人"})
group["グループD"].append({"クラス":"NHIT11B203","出席番号":"03","氏名":"安藤優叶"})
group["グループD"].append({"クラス":"NHIT11B203","出席番号":"06","氏名":"井上陽輝"})
group["グループD"].append({"クラス":"NHIT11B203","出席番号":"07","氏名":"岩田綺華"})
group["グループD"].append({"クラス":"NHIT11B203","出席番号":"08","氏名":"大洞和馬"})
group["グループE"].append({"クラス":"NHIT11A203","出席番号":"12","氏名":"新海尊琉"})
group["グループE"].append({"クラス":"NHIT11A203","出席番号":"13","氏名":"菅沼智城"})
group["グループE"].append({"クラス":"NHIT11A203","出席番号":"14","氏名":"鈴木海斗"})
group["グループE"].append({"クラス":"NHIT11A203","出席番号":"24","氏名":"長多悠都"})
group["グループE"].append({"クラス":"NHIT11A203","出席番号":"25","氏名":"橋本蒼龍"})
group["グループE"].append({"クラス":"NHIT11A203","出席番号":"26","氏名":"原巧海"})
group["グループF"].append({"クラス":"NHIT11B203","出席番号":"04","氏名":"池田峰皐"})
group["グループF"].append({"クラス":"NHIT11B203","出席番号":"05","氏名":"伊藤李空"})
group["グループF"].append({"クラス":"NHIT11B203","出席番号":"18","氏名":"谷分航晟"})
group["グループF"].append({"クラス":"NHIT11B203","出席番号":"12","氏名":"須田陸斗"})
group["グループF"].append({"クラス":"NHIT11B203","出席番号":"19","氏名":"塚本博希"})
group["グループG"].append({"クラス":"NHIT11A203","出席番号":"01","氏名":"秋山瑠架"})
group["グループG"].append({"クラス":"NHIT11A203","出席番号":"02","氏名":"浅野晴斗"})
group["グループG"].append({"クラス":"NHIT11A203","出席番号":"03","氏名":"安彦武志"})
group["グループG"].append({"クラス":"NHIT11A203","出席番号":"04","氏名":"石川蒼大"})
group["グループG"].append({"クラス":"NHIT11B203","出席番号":"16","氏名":"竹内海翔"})
group["グループH"].append({"クラス":"NHIT11A203","出席番号":"07","氏名":"大辻慶吾"})
group["グループH"].append({"クラス":"NHIT11A203","出席番号":"08","氏名":"太町智哉"})
group["グループH"].append({"クラス":"NHIT11A203","出席番号":"11","氏名":"久保彦太"})
group["グループH"].append({"クラス":"NHIT11A203","出席番号":"16","氏名":"高畠ジョン"})
group["グループH"].append({"クラス":"NHIT11A203","出席番号":"22","氏名":"出口大誠"})
group["グループH"].append({"クラス":"NHIT11A203","出席番号":"23","氏名":"ナカオガブリエル"})
group["グループH"].append({"クラス":"NHIT11B203","出席番号":"33","氏名":"山澤天人"})
group["グループH"].append({"クラス":"NHIT41A203","出席番号":"02","氏名":"遠藤笙之"})
group["グループH"].append({"クラス":"NHIT41A203","出席番号":"06","氏名":"小林琉生"})
group["グループH"].append({"クラス":"NHIT41A203","出席番号":"08","氏名":"丹羽結飛"})
group["グループI"].append({"クラス":"NHIT11B203","出席番号":"10","氏名":"黒田航太朗"})
group["グループI"].append({"クラス":"NHIT11B203","出席番号":"15","氏名":"髙松航太"})
group["グループI"].append({"クラス":"NHIT11B203","出席番号":"30","氏名":"満颯太"})
group["グループI"].append({"クラス":"NHIT41A203","出席番号":"01","氏名":"阿野彰太"})
group["グループI"].append({"クラス":"NHIT11A203","出席番号":"17","氏名":"竹内崇馬"})
group["グループJ"].append({"クラス":"NHIT11A203","出席番号":"06","氏名":"岩田直也"})
group["グループJ"].append({"クラス":"NHIT11A203","出席番号":"09","氏名":"亀山陽気"})
group["グループJ"].append({"クラス":"NHIT11A203","出席番号":"10","氏名":"河原諒晟"})
group["グループJ"].append({"クラス":"NHIT41A203","出席番号":"03","氏名":"木村心咲"})
group["グループJ"].append({"クラス":"NHIT41A203","出席番号":"05","氏名":"源水大智"})
group["グループK"].append({"クラス":"NHIT11B203","出席番号":"09","氏名":"カドカサガル"})
group["グループK"].append({"クラス":"NHIT11B203","出席番号":"20","氏名":"仲田ゆうじ"})
group["グループK"].append({"クラス":"NHIT11B203","出席番号":"21","氏名":"中山駿"})
group["グループK"].append({"クラス":"NHIT11B203","出席番号":"31","氏名":"三輪彰"})
group["グループK"].append({"クラス":"NHIT11B203","出席番号":"32","氏名":"森将茂"})
group["グループL"].append({"クラス":"NHIT11B203","出席番号":"11","氏名":"菅沼迦音"})
group["グループL"].append({"クラス":"NHIT11B203","出席番号":"29","氏名":"溝口翔斗"})
group["グループL"].append({"クラス":"NHIT11A203","出席番号":"32","氏名":"南登夢"})
group["グループL"].append({"クラス":"NHIT41A203","出席番号":"04","氏名":"金城羽奏"})
group["グループL"].append({"クラス":"NHIT11B203","出席番号":"14","氏名":"髙橋凜乃介"})
group["グループM"].append({"クラス":"NHIT11B203","出席番号":"02","氏名":"朝倉柚汰"})
group["グループM"].append({"クラス":"NHIT11A203","出席番号":"15","氏名":"髙橋拓真"})
group["グループM"].append({"クラス":"NHIT11B203","出席番号":"17","氏名":"田中大雅"})
group["グループM"].append({"クラス":"NHIT11A203","出席番号":"05","氏名":"伊藤舶"})

for g in group:
    for member in group[g]:
        print(member)

# あなたのデータだけ出力してみて！

print(group["グループL"][1]["氏名"])
#print(groupの中の[グループLの][1番目の(0番目からある)][名前を持ってくる])

#かのん
print(group["グループL"][0]["氏名"])

#みつ
print(group["グループI"][2]["氏名"])

kigou = input("クラス記号は")
bangou = input("番号は")

if kigou == "11A":
    print("11A")